


#Область ОбработчикиСобытийФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОформитьПоступленияТоваров(Команда)
	
	ОдинЧас = 60*60;
	ДевятьЧасов = 9 * ОдинЧас;
	ЧетыреЧаса = 4 * ОдинЧас;
	ДвадцатьЧасов = 20 * ОдинЧас;
	ЗаполнитьСпискиДаннызДляГенерации();
	Объект.ВремяНачалаГенерации = ТекущаяДата();
	//ТекущаяДатаКомпьютера = Формат(Объект.ВремяНачалаГенерации, "ДФ=dd-MM-yy");
	//ДатаНачалаОбработки = Формат(НачалоМесяца(Объект.ВремяНачалаГенерации), "ДФ=dd-MM-yy");
	ДатаНачалаОтсчета = НачалоДня(ТекущаяДата()) + ДевятьЧасов;
	ВремяДоставки = ДатаНачалаОтсчета;
	ПоследнийИтераторВремени = ДвадцатьЧасов;
	//КомандаСистемы("date " + ДатаНачалаОбработки);
	ГенераторИндексов = НовыйГенераторСлучайногоЧисла();
	КоличествоПоставщиков = Объект.ПоставщикиТовара.Количество() - 1;
	КоличествоВорот = Объект.ВоротаПриемки.Количество() - 1;
	//ОформитьПоступленияТоваровНаСервере();
	ЗарегистрироватьФактическоеРасписаниеСотрудниковНаСервере(Ложь, ДатаНачалаОтсчета);
	Пока ВремяДоставки < Объект.ВремяНачалаГенерации Цикл
		ИндексПоставщика = ГенераторИндексов.СлучайноеЧисло(0, КоличествоПоставщиков);
		ИндексВорот = ГенераторИндексов.СлучайноеЧисло(0, КоличествоВорот);
		УстановитьДатуИВремяКомпьютера(ВремяДоставки);
		ОформитьПоступленияТоваровНаСервере(ИндексПоставщика, ИндексВорот);
		ПереместитьКонтейнерыИзЗоныПриемки();
		Если ПоследнийИтераторВремени = ДвадцатьЧасов Тогда
			ВремяДоставки = ВремяДоставки + ЧетыреЧаса;
			ПоследнийИтераторВремени = ЧетыреЧаса;
			ЗарегистрироватьФактическоеРасписаниеСотрудниковНаСервере(Истина, ДатаНачалаОтсчета + ДевятьЧасов);
		Иначе
			ВремяДоставки = ВремяДоставки + ДвадцатьЧасов;
			ПоследнийИтераторВремени = ДвадцатьЧасов;
			ЗарегистрироватьФактическоеРасписаниеСотрудниковНаСервере(Ложь, ДатаНачалаОтсчета);
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьДатуИВремяКомпьютера(Объект.ВремяНачалаГенерации);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОформитьПоступленияТоваровНаСервере(ИндексПоставщика, ИндексВорот)
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ОформитьПоступленияТоваров(ИндексПоставщика, ИндексВорот);
	ЗначениеВРеквизитФормы(ОбъектОбработка, "Объект");
	
КонецПроцедуры

&Насервере
Процедура ЗаполнитьСпискиДаннызДляГенерации()

	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ЗаполнитьСпискиДляГенерацииДанных();
	ЗначениеВРеквизитФормы(ОбъектОбработка, "Объект");

КонецПроцедуры

&Насервере
Процедура ЗарегистрироватьФактическоеРасписаниеСотрудниковНаСервере(ЭтоУбытие, ДатаФиксации)

	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ЗарегистрироватьФактическоеРасписаниеСотрудников(ЭтоУбытие, ДатаФиксации);
	ЗначениеВРеквизитФормы(ОбъектОбработка, "Объект");

КонецПроцедуры

&Насервере
Процедура ПередатьДокументПеремещенияКонтейнераНаВыполнениеСервер(ЗадачаПеремещенияКонтейнера)

	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	Ошибка = "";
	ГенераторИндексов = Новый ГенераторСлучайныхЧисел(ТекущаяДата() - Дата("00010101"));
	ИндексИсполнителя = ГенераторИндексов.СлучайноеЧисло(0, Объект.СотрудникиПриемки.Количество() - 1);
	Сотрудник = Объект.СотрудникиПриемки[ИндексИсполнителя].Сотрудник;
	
	ОбъектОбработка.ЗаписатьСостояниеСотрудника(ТекущаяДата(), Сотрудник, Ложь);
	усУправлениеЗадачами.ПолучитьЗадачуДляИсполнителя(Сотрудник, ЗадачаПеремещенияКонтейнера, Ложь, Неопределено);

КонецПроцедуры

&Насервере
Процедура ВыполнитьДокументПеремещенияКонтейнераНаВыполнениеСервер(ЗадачаПеремещенияКонтейнера)

	Ошибка = "";
	Уровень = 0;
	текОбъект = ЗадачаПеремещенияКонтейнера.ПолучитьОбъект();
	усУправлениеЗадачами.ВыполнитьДействиеПоложитьЦелыйКонтейнер(текОбъект, текОбъект.КонечнаяЯчейка, Неопределено, Уровень, Ошибка);
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ЗаписатьСостояниеСотрудника(ТекущаяДата(), текОбъект.Исполнитель, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьКонтейнерыИзЗоныПриемки()

	ДатаНачалаПеремещения = Объект.ВремяОкончанияПриемки;
	ГенераторИндексов = НовыйГенераторСлучайногоЧисла();
	Для Каждого ДокументПеремещейния Из Объект.ЗадачиПеремещенияКонтейнеров Цикл
		ИтераторВремени = ГенераторИндексов.СлучайноеЧисло(60, 300);
		ВремяПередачиКВыполнению = ДатаНачалаПеремещения + ИтераторВремени;
		УстановитьДатуИВремяКомпьютера(ВремяПередачиКВыполнению);
		ПередатьДокументПеремещенияКонтейнераНаВыполнениеСервер(ДокументПеремещейния.Ссылка);
		
		ИтераторВремени = ГенераторИндексов.СлучайноеЧисло(60, 300);
		ВремяПередачиКВыполнению = ВремяПередачиКВыполнению + ИтераторВремени;
		УстановитьДатуИВремяКомпьютера(ВремяПередачиКВыполнению);
		ВыполнитьДокументПеремещенияКонтейнераНаВыполнениеСервер(ДокументПеремещейния.Ссылка);
		ИтераторВремени = ГенераторИндексов.СлучайноеЧисло(60, 300);
		ДатаНачалаПеремещения = ДатаНачалаПеремещения + ИтераторВремени;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуИВремяКомпьютера(НоваяДата)

	УстанавливаемаяДата = Формат(НоваяДата, "ДФ=dd-MM-yy");
	КомандаСистемы("date " + УстанавливаемаяДата);
	УстанавливаемоеВремя = Формат(НоваяДата, "ДФ=HH:mm:ss");
	КомандаСистемы("time " + УстанавливаемоеВремя);

КонецПроцедуры

&НаКлиенте
Функция НовыйГенераторСлучайногоЧисла()

	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяДата() - Дата("00010101"));
	
	Возврат ГСЧ;

КонецФункции // НовыйГенераторСлучайногоЧисла()

#КонецОбласти